"""Домашнє завдання №4: Послідовності та колекції

a) List (список)
Preconditions:
    Створити список міст України, наприклад: Львів, Київ, Одеса, Дніпро, Суми
    Створити список з міст, які Ви вже колись відвідали, наприклад Київ, Львів
Завдання:
    Пройтись по списку відвіданих міст, вилучити поточне місто з першого списку,
    надрукувати його в консоль.
Очікуваний результат:
    В першому списку міст залишились тільки ті міста, які Ви ще не відвідали."""

city = ['Львів', 'Київ', 'Одеса', 'Дніпро', 'Суми']
city_vidvidala = ['Київ', 'Одеса']
city.pop(1)
city.pop(2)
print(city)
print(city_vidvidala)

"""b) Tuple (кортеж)
Preconditions:
    Створити кортеж елементів, наприклад 3, 'one', 2.25
Завдання:
    1. Вивести в консоль всі об'єкти кортежу циклом
    2. Спробувати змінити елемент кортежу в індексі 0 (очікуємо помилку)
    3. Знайти спосіб змінити кортеж так, щоб першим елементом стало число збільшене на 2
       (підказка: можна використати кастинг (приведення до певного типу))"""

a = (3, 'one', 5.1, 'True', 'Python')

for x in a:
    print(x)

change_tuple = list(a)
change_tuple[0] = 3*2
a = tuple(change_tuple)
print(a)

"""с) String (Рядок)
Preconditions:
    Створити будь-який рядок українською мовою, маленькими літерами, що міститиме
    кілька голосних літер
Завдання:
    Використовуючи list comprehension та join відтворити цей рядок таким чином,
    щоб всі голосні літери стали великими"""

_string = 'kluvoxresc'
golosni = "eou"
_string = [y.upper() if y in golosni else y for y in _string]
result = "".join(_string)

print(result)

"""d) Set (Множина)
Preconditions:
    Створити список з кількох літер, деякі з яких повторюються та є голосні літери
Завдання:
    Перетворити цей список на множину, з заміною малих голосних літер на великі"""

words = 'aabcdaffey'
golosni = 'aey'
words = [x.upper() if x in golosni else x for x in words]
result = "".join(words)
print(set(result))


"""e) Dictionary (Словник)
Preconditions:
    Створити 2 списки: [1, 2, 3] та ['one', 'two', 'three']
Завдання:
    1. Перетворити ці 2 списки на словник, де ключами буде перший список, а значеннями -- другий
    2. В словнику що утворився, поміняти місцями ключі та значення
    3. Погуглити, почитати і запам'ятати які об'єкти можуть виступати ключами в словнику
       та спробувати зрозуміти чому це так"""

first = [1, 2, 3]
second = ['one', 'two', 'three']
second_fruit = dict(zip(first, second))
print(second_fruit)
second_fruit2 = {value: key for key, value in second_fruit.items()}
print(second_fruit2)